Project/Toir.Adaptation/src/DataProcessors/гкс_АРМУчетаСвязейФМ/гкс_АРМУчетаСвязейФМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>гкс_АРМУчетаСвязейФМ</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

Project/Toir.Adaptation/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="774db338-91f2-4ead-8895-fd51f145458a">
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d8481881-51b9-4962-8b6c-bfa78e30e457">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="2c99b177-de41-496b-bfc8-0cd1b039671a">
    <name>Удален</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="280e0fd3-b182-49f3-abd2-2c4247cfe274">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6bc5297f-c3fd-4ba2-ad6f-c69875395c47">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ИерархическиеСтруктурыОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ecf4614a-f3c8-44c8-9355-8a406a840ca5">
    <name>РодительИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c4d866bf-46bc-412c-b7cf-a88074622812">
    <name>ОбъектИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7f327261-9505-4dcb-bf45-cd6eb8ce0242">
    <name>СтруктураИерархии</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/DataProcessors/гкс_АРМУчетаСвязейФМ/Forms/Форма_1/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы = Ложь Тогда 
		Если ЕстьИзменения Тогда 
			Отказ = Истина; СтандартнаяОбработка = Ложь;
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПослеВопроса", ЭтотОбъект,
				Новый Структура("ЗакрытьПослеЗаписи", Истина));
			ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Введенные данные не сохранены. Сохранить?'"), 
				РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если ЗначениеЗаполнено(Иерархия) Тогда 
		ИзменяетсяДокументами = Иерархия.ИзменяетсяДокументами;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Иерархия не определена'");
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ПостроитьДерево();
	Элементы.ДеревоПодчиненный.ТолькоПросмотр = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаКлиенте
Процедура ДеревоГлавныйПриАктивизацииСтроки(Элемент)

	ТекДанные = Элементы.ДеревоГлавный.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если Главный = ТекДанные.Ссылка Тогда 
			Возврат;
		КонецЕсли;
		Если ЕстьИзменения Тогда 
			ТекстВопроса = НСтр("ru='Сохранить изменения?'");
			ОписаниеОповещенияПослеВопроса = Новый ОписаниеОповещения("СохранитьПослеВопроса", ЭтотОбъект,Новый Структура());
			ПоказатьВопрос(ОписаниеОповещенияПослеВопроса, ТекстВопроса,
				РежимДиалогаВопрос.ДаНетОтмена);
			Возврат;
		КонецЕсли;
		Если ТекДанные.ЭтоГруппа = Ложь Тогда 
			Элементы.ДеревоПодчиненныйВыбран.Видимость = Истина;
			Элементы.ДеревоПодчиненныйВыбран1.Видимость = Истина;
			Элементы.ДеревоПодчиненныйМуляж.Видимость = Ложь;
			Элементы.ДеревоПодчиненныйМуляж1.Видимость = Ложь;
			Элементы.ДеревоПодчиненный.ТолькоПросмотр = Ложь;
			ПодключитьОбработчикОжидания("ОбновитьДеревоПодчиненных", 0.1, Истина);
		Иначе
			Элементы.ДеревоПодчиненный.ТолькоПросмотр = Истина;
			Элементы.ДеревоПодчиненныйВыбран.Видимость = Ложь;
			Элементы.ДеревоПодчиненныйВыбран1.Видимость = Ложь;
			Элементы.ДеревоПодчиненныйМуляж.Видимость = Истина;
			Элементы.ДеревоПодчиненныйМуляж1.Видимость = Истина;
		КонецЕсли;
		Главный = ТекДанные.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоПодчиненных()
	ОбновитьДеревоПодчиненныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоПодчиненныхНаСервере()
	МассивВыбранных = Новый Массив();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК Подчиненный,
		|	МАКСИМУМ(торо_РемонтыОсновногоЗависимогоОборудования.гкс_Остановочная) КАК Выбран,
		|	МАКСИМУМ(торо_РемонтыОсновногоЗависимогоОборудования.гкс_Технологическая) КАК Выбран1
		|ИЗ
		|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|ГДЕ
		|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &Главный
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта";

	
	Запрос.УстановитьПараметр("Главный", Главный);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Корень = ДеревоГлавный.ПолучитьЭлементы();
	ОбновитьРекурсияНаСервере(Корень,Выборка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьРекурсияНаСервере(Корень,МассивВыбранных)
	Для Каждого СтрокаКорня Из Корень Цикл
		СтрокаКорня.Выбран = Ложь;
		СтрокаКорня.Выбран1 = Ложь;
		Если СтрокаКорня.ЭтоГруппа = Ложь Тогда 
			ЕстьФМ = Истина;
			Если МассивВыбранных.НайтиСледующий(Новый Структура("Подчиненный", СтрокаКорня.Ссылка)) Тогда
				СтрокаКорня.Выбран = МассивВыбранных.Выбран ИЛИ МассивВыбранных.Выбран1 = Ложь;
				СтрокаКорня.Выбран1 = МассивВыбранных.Выбран1;
			КонецЕсли;
			МассивВыбранных.Сбросить();
		КонецЕсли;
		ОбновитьРекурсияНаСервере(СтрокаКорня.ПолучитьЭлементы(),МассивВыбранных);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПостроитьДерево()
	ДеревоГлавный.ПолучитьЭлементы().Очистить();
	//
	МассивОР = Новый Массив();
	МассивОР.Добавить(Справочники.торо_ОбъектыРемонта.ПустаяСсылка());
	МассивСтрокУровня = Новый Массив();
	МассивСтрокУровня.Добавить(ДеревоГлавный);
	АнтиЦикл = 12;
	Пока МассивОР.Количество() > 0 Цикл 
		АнтиЦикл = АнтиЦикл - 1;
		Если АнтиЦикл <= 0 Тогда 
			Прервать;
		КонецЕсли;
		Запрос = Новый Запрос;
		Если ИзменяетсяДокументами Тогда 
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Рег.РодительИерархии КАК Родитель,
				|	Рег.ОбъектИерархии КАК Объект,
				|	Рег.ОбъектИерархии.ПометкаУдаления КАК ПометкаУдаления,
				|	Рег.ОбъектИерархии.ТехНомер КАК ТехНомер,
				|	Рег.ОбъектИерархии.ЭтоГруппа КАК ЭтоГруппа
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			СтруктураИерархии = &СтруктураИерархии
				|				И (ОбъектИерархии.ЭтоГруппа
				|					ИЛИ ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))) КАК Рег
				|ГДЕ
				|	Рег.РодительИерархии В(&РодительИерархии)
				|ИТОГИ ПО
				|	Родитель";
		Иначе
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Рег.РодительИерархии КАК Родитель,
				|	Рег.ОбъектИерархии КАК Объект,
				|	Рег.ОбъектИерархии.ЭтоГруппа КАК ЭтоГруппа,
				|	Рег.ОбъектИерархии.ТехНомер КАК ТехНомер,
				|	Рег.ОбъектИерархии.ПометкаУдаления КАК ПометкаУдаления
				|ИЗ
				|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК Рег
				|ГДЕ
				|	Рег.СтруктураИерархии = &СтруктураИерархии
				|	И (Рег.ОбъектИерархии.ЭтоГруппа = ИСТИНА
				|			ИЛИ Рег.ОбъектИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
				|	И Рег.РодительИерархии В(&РодительИерархии)
				|ИТОГИ ПО
				|	Родитель";
		КонецЕсли;
		Запрос.УстановитьПараметр("РодительИерархии", МассивОР);
		Запрос.УстановитьПараметр("СтруктураИерархии", Иерархия);
		РезультатЗапроса = Запрос.Выполнить();	
		МассивОР.Очистить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			ВыборкаРодитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			ТемпМассив = Новый Массив();
			Для Каждого СтрокаУровня Из МассивСтрокУровня Цикл
				Если ВыборкаРодитель.НайтиСледующий(
					Новый Структура("Родитель",?(ТипЗнч(СтрокаУровня) = Тип("ДанныеФормыДерево"),
						Справочники.торо_ОбъектыРемонта.ПустаяСсылка(), СтрокаУровня.Ссылка))) Тогда 
					ТекЭлементы = СтрокаУровня.ПолучитьЭлементы();
					
					Выборка = ВыборкаРодитель.Выбрать();
					Пока Выборка.Следующий() Цикл
						НоваяСтрока = ТекЭлементы.Добавить();
						НоваяСтрока.Ссылка = Выборка.Объект;
						НоваяСтрока.ТехНомер = Выборка.ТехНомер;
						НоваяСтрока.ЭтоГруппа = Выборка.ЭтоГруппа;
						Если Выборка.ЭтоГруппа Тогда 
							Если Выборка.ПометкаУдаления Тогда 
								НоваяСтрока.Картинка = 6;
							Иначе
								НоваяСтрока.Картинка = 5;
							КонецЕсли;
						Иначе
							Если Выборка.ПометкаУдаления Тогда 
								НоваяСтрока.Картинка = 12;
							Иначе
								НоваяСтрока.Картинка = 11;
							КонецЕсли;
						КонецЕсли;
						ТемпМассив.Добавить(НоваяСтрока);
						МассивОР.Добавить(Выборка.Объект);
					КонецЦикла;
				КонецЕсли;
				ВыборкаРодитель.Сбросить();
			КонецЦикла;
			МассивСтрокУровня = ТемпМассив;
		КонецЕсли;
	КонецЦикла;
	ОчиститьДеревоОтПустыхГрупп(ДеревоГлавный.ПолучитьЭлементы());
КонецПроцедуры

&НаСервере
Процедура ОчиститьДеревоОтПустыхГрупп(Корень, ЕстьФМ = Ложь)
	МассивКУдалению = Новый Массив();
	Для Каждого СтрокаКорня Из Корень Цикл
		Элементы.ПоискПодчиненный.СписокВыбора.Добавить(СтрокаКорня.Ссылка);
		Элементы.ПоискГлавный.СписокВыбора.Добавить(СтрокаКорня.Ссылка);
		Если ЗначениеЗаполнено(СтрокаКорня.ТехНомер) Тогда 
			Элементы.ПоискПодчиненный.СписокВыбора.Добавить(СтрокаКорня.Ссылка,СтрокаКорня.ТехНомер);
			Элементы.ПоискГлавный.СписокВыбора.Добавить(СтрокаКорня.Ссылка,СтрокаКорня.ТехНомер);
		КонецЕсли;
		ЕстьГлубже = Ложь;
		ОчиститьДеревоОтПустыхГрупп(СтрокаКорня.ПолучитьЭлементы(), ЕстьГлубже);
		Если СтрокаКорня.ЭтоГруппа = Ложь ИЛИ ЕстьГлубже Тогда 
			ЕстьФМ = Истина;
		Иначе
			МассивКУдалению.Добавить(СтрокаКорня);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаМассива Из МассивКУдалению Цикл
		Корень.Удалить(СтрокаМассива);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СохранитьСвязьНаСервере();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 
		Главный = Неопределено;
	Иначе
		СтруктураТекущейСтроки = Новый Структура("ОР",Главный);
		УстановитьТекущуюСтрокуНаСервере(СтруктураТекущейСтроки);
		Если СтруктураТекущейСтроки.Свойство("Идентификатор") Тогда 
			Элементы.ДеревоГлавный.ТекущаяСтрока = СтруктураТекущейСтроки.Идентификатор;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	Если ДопПараметры.Свойство("ЗакрытьПослеЗаписи") И ДопПараметры.ЗакрытьПослеЗаписи Тогда 
		Закрыть();
	Иначе
		ДеревоГлавныйПриАктивизацииСтроки(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСвязьНаСервере()
	ТЧ = новый ТаблицаЗначений();
	ТЧ.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
	ТЧ.Колонки.Добавить("Выбран",Новый ОписаниеТипов("Булево"));
	ТЧ.Колонки.Добавить("Выбран1",Новый ОписаниеТипов("Булево"));
	Корень = ДеревоГлавный.ПолучитьЭлементы();
	СобратьРекурсияНаСервере(Корень, ТЧ);
	//
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Ссылка КАК Ссылка,
		|	ТЧ.Выбран КАК Выбран,
		|	ТЧ.Выбран1 КАК Выбран1
		|ПОМЕСТИТЬ Исходные
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта КАК Подчиненный
		|ПОМЕСТИТЬ ВсеПоГлавному
		|ИЗ
		|	РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|ГДЕ
		|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта = &Главный
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Исходные.Ссылка КАК Ссылка,
		|	Исходные.Выбран КАК гкс_Остановочная,
		|	Исходные.Выбран1 КАК гкс_Технологическая,
		|	торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта ЕСТЬ NULL КАК Свободен
		|ИЗ
		|	Исходные КАК Исходные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтыОсновногоЗависимогоОборудования КАК торо_РемонтыОсновногоЗависимогоОборудования
		|		ПО Исходные.Ссылка = торо_РемонтыОсновногоЗависимогоОборудования.ОсновнойОбъектРемонта
		|			И (торо_РемонтыОсновногоЗависимогоОборудования.СвязанныйОбъектРемонта = &Главный)
		|ГДЕ
		|	(Исходные.Выбран = ИСТИНА
		|			ИЛИ Исходные.Выбран1 = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Исходные.Ссылка КАК Ссылка
		|ИЗ
		|	Исходные КАК Исходные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеПоГлавному КАК ВсеПоГлавному
		|		ПО Исходные.Ссылка = ВсеПоГлавному.Подчиненный
		|ГДЕ
		|	Исходные.Выбран = ЛОЖЬ
		|	И Исходные.Выбран1 = ЛОЖЬ";
	Запрос.УстановитьПараметр("Главный", Главный);	
	Запрос.УстановитьПараметр("ТЧ", ТЧ);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	ИндексОсновногоПакета = 2;
	ИндексДополнительногоПакета = 3;
	Выборка = РезультатЗапроса[ИндексОсновногоПакета].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Свободен Тогда 
			НаборЗаписей = РегистрыСведений.торо_РемонтыОсновногоЗависимогоОборудования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОсновнойОбъектРемонта.Установить(Главный);
			НаборЗаписей.Отбор.СвязанныйОбъектРемонта.Установить(Выборка.Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда 
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.ОсновнойОбъектРемонта = Главный;
				НоваяСтрока.СвязанныйОбъектРемонта = Выборка.Ссылка;
			КонецЕсли;
			Для Каждого НоваяСтрока ИЗ НаборЗаписей Цикл
				НоваяСтрока.гкс_Остановочная = Выборка.гкс_Остановочная;
				НоваяСтрока.гкс_Технологическая = Выборка.гкс_Технологическая;
			КонецЦикла;
			НаборЗаписей.Записать();
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru='Обнаружено зацикливание. Связь не сохранена:'") + " " 
				+ Строка(Главный) + " - " + Строка(Выборка.Ссылка);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[ИндексДополнительногоПакета].Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.торо_РемонтыОсновногоЗависимогоОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОсновнойОбъектРемонта.Установить(Главный);
		НаборЗаписей.Отбор.СвязанныйОбъектРемонта.Установить(Выборка.Ссылка);
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСвязь(Команда)
	СохранитьСвязьНаСервере();
	ЕстьИзменения = Ложь;
КонецПроцедуры

&НаСервере
Процедура СобратьРекурсияНаСервере(Корень,МассивВыбранных)
	Для Каждого СтрокаКорня Из Корень Цикл
		Если СтрокаКорня.ЭтоГруппа = Ложь Тогда 
			НоваяСтрока = МассивВыбранных.Добавить();
			НоваяСтрока.Ссылка = СтрокаКорня.Ссылка;
			НоваяСтрока.Выбран = СтрокаКорня.Выбран;
			НоваяСтрока.Выбран1 = СтрокаКорня.Выбран1;
		КонецЕсли;
		СобратьРекурсияНаСервере(СтрокаКорня.ПолучитьЭлементы(),МассивВыбранных);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодчиненныйВыбранПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоПодчиненный.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.ЭтоГруппа Тогда 
			ТекДанные.Выбран = Ложь;
			ТекДанные.ТипСвязи = Неопределено;
		ИначеЕсли ТекДанные.Ссылка = Главный Тогда 
			ТекДанные.Выбран = Ложь;
			ТекДанные.ТипСвязи = Неопределено;
		Иначе
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодчиненныйТипСвязиПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоПодчиненный.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.ЭтоГруппа Тогда 
			ТекДанные.Выбран = Ложь;
			ТекДанные.ТипСвязи = Неопределено;
		ИначеЕсли ТекДанные.Ссылка = Главный Тогда 
			ТекДанные.Выбран = Ложь;
			ТекДанные.ТипСвязи = Неопределено;
		Иначе
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуНаСервере(СтруктураТекущейСтроки)
	Если ЗначениеЗаполнено(СтруктураТекущейСтроки) Тогда 
		ПеременнаяИдентификатор = 0;
		НайтиИдентификаторГлубже(ДеревоГлавный.ПолучитьЭлементы(), СтруктураТекущейСтроки.ОР, ПеременнаяИдентификатор);
		СтруктураТекущейСтроки.Вставить("Идентификатор",ПеременнаяИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НайтиИдентификаторГлубже(Ветвь, ОР, ПеременнаяИдентификатор)
	Для Каждого Элемент Из Ветвь Цикл
		Если Элемент.Ссылка = ОР Тогда 
			ПеременнаяИдентификатор = Элемент.ПолучитьИдентификатор();
			Возврат;
		Иначе
			НайтиИдентификаторГлубже(Элемент.ПолучитьЭлементы(), ОР, ПеременнаяИдентификатор);
			Если ЗначениеЗаполнено(ПеременнаяИдентификатор) Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодчиненныйВыбран1ПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоПодчиненный.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.ЭтоГруппа Тогда 
			ТекДанные.Выбран1 = Ложь;
			ТекДанные.ТипСвязи = Неопределено;
		ИначеЕсли ТекДанные.Ссылка = Главный Тогда 
			ТекДанные.Выбран1 = Ложь;
			ТекДанные.ТипСвязи = Неопределено;
		Иначе
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискПодчиненныйПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПоискПодчиненный) Тогда 
		СтруктураТекущейСтроки = Новый Структура("ОР",ПоискПодчиненный);
		УстановитьТекущуюСтрокуНаСервере(СтруктураТекущейСтроки);
		Если СтруктураТекущейСтроки.Свойство("Идентификатор") Тогда 
			Элементы.ДеревоПодчиненный.ТекущаяСтрока = СтруктураТекущейСтроки.Идентификатор;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискГлавныйПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПоискГлавный) Тогда 
		СтруктураТекущейСтроки = Новый Структура("ОР",ПоискГлавный);
		УстановитьТекущуюСтрокуНаСервере(СтруктураТекущейСтроки);
		Если СтруктураТекущейСтроки.Свойство("Идентификатор") Тогда 
			Элементы.ДеревоГлавный.ТекущаяСтрока = СтруктураТекущейСтроки.Идентификатор;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
